// 2. ALGORITHMIZATION
// Одномерные массивы. Сортировки.
//                 Задача 5.
// Сортировка вставками (и бинарый поиск)
import java.util.Arrays;
import java.util.Scanner;

/*Сортировка вставками. Дана последовательность чисел a1,a2,a3,a4...aN.
   Требуется переставить числа в порядке возрастания. Делается это следующим образом.
   Пусть a1, a2, a3 .. aN упорядоченная последовательность, т.е. a1<=a2<=...<=aN.
   Берется следующее число ai+1 и вставляется в последовательность так, чтобы новая
   последовательность была тоже возрастающей.
   Процесс производится до тех пор, пока все элементы от i+1 до n не будут перебраны.
   Примечание. Место помещения очередного элемента в отсортированную часть производить
   с помощью двоичного поиска. Двоичный поиск оформить в виде отдельной функции.
 */
public class Array31 {
    public static void main(String[] args) {

    }
    private static int binarySearch(int[] array, int lastIndex, int element) {
        return a ;

    }
}
// пропустил , не забыть доделать